//系统名      :   通用Web框架
//-----------<类 说 明>-------------------------------------------------------------------------- 
//功能概况    :   枚举数据库类别
//编写日期    :   2010-11-22
//-----------<修改记录>--------------------------------------------------------------------------
//修改日期  修改者  修改内容
//
//----------------------------------------------------------------------------------------------- 
//Copyright (C) 2013,Shanghai Great Wisdom Co.,Ltd. All Rights Reserved.
//-----------------------------------------------------------------------------------------------
using System;
using System.Collections.Generic;
using System.Text;

namespace GW.Utils.DataAccess
{
    /// <summary>
    /// 提供的数据库类型
    /// </summary>
    public enum DatabaseType
    {
        SqlServer,
        Oracle,        
        MySql
    }
}
